
#include "reg52.h"
#include "intrins.h"

/*
**********************************************************************
*                        本地宏定义
**********************************************************************
*/
#define uint unsigned int
#define uchar unsigned char
sbit voice=P1^5;

uint C;

#define dao 523 // 音符1， 频率为523HZ，下面依次类推
#define re 587  
#define mi 659
#define fa 698
#define sao 784
#define la 880
#define xi 987

/*
**********************************************************************
*                        小星星歌谱
**********************************************************************
*/
uint code sound[]={
									dao, dao, sao, sao, la, la, sao,
									fa, fa, mi, mi, re, re, dao,
									sao, sao, fa, fa, mi, mi, re,
									sao, sao, fa, fa, mi, mi, re,
									dao, dao, sao, sao, la, la, sao,
									fa, fa, mi, mi, re, re, dao,
									0xff};

/*
**********************************************************************
*                        小星星节拍
**********************************************************************
*/
uchar code JP[] = {
									2,2,2,2,2,2,4,
									2,2,2,2,2,2,4,
									2,2,2,2,2,2,4,
									2,2,2,2,2,2,4,
									2,2,2,2,2,2,4,
									2,2,2,2,2,2,4,
									};

/*
**********************************************************************
*                        定义延迟200ms的函数
**********************************************************************
*/								
void delay200ms(void);

									
/*
**********************************************************************
*                        函数主程序
**********************************************************************
*/
void main(void)
{
	uchar i, j;
	EA = 1;
	ET0 = 1;
	TMOD = 0x00;
	
	while(1)
  {  
		i = 0;
		while(sound[i] != 0xff)
		{
			C = 460830 / sound[i];
			TH0 = (8192 - C) / 32;
			TL0 = (8192 - C) % 32;
			TR0 = 1;
			
			for(j = 0; j < JP[i]; j++)
			{
				delay200ms();
			}
			
			TR0 = 0;
			i++;
		}      
  }
}

time0() interrupt 1  using 1
{
	voice = !voice;
  TH0 = (8192 - C) / 32;
	TL0 = (8192 - C) % 32;
}

void delay200ms(void)   //?? 0us
{
    unsigned char a,b,c;
    for(c=4;c>0;c--)
        for(b=116;b>0;b--)
            for(a=214;a>0;a--);
    _nop_();  //if Keil,require use intrins.h
}
